#pragma once
#include<windows.h>






//--------------------------------------------------------------------------------------------
// DB 저장 메시지의 헤더
//--------------------------------------------------------------------------------------------

struct st_DBQUERY_HEADER
{
	WORD	Type;
	WORD	Size;
};

//--------------------------------------------------------------------------------------------
//  DB 저장 메시지 - 회원가입
//--------------------------------------------------------------------------------------------
#define df_DBQUERY_MSG_NEW_ACCOUNT		0
struct st_DBQUERY_MSG_NEW_ACCOUNT
{
	char	szID[20];
	char	szPassword[20];
};

//--------------------------------------------------------------------------------------------
//  DB 저장 메시지 - 스테이지 클리어
//--------------------------------------------------------------------------------------------
#define df_DBQUERY_MSG_STAGE_CLEAR		1
struct st_DBQUERY_MSG_STAGE_CLEAR
{
	__int64	iAccountNo;
	int	iStageID;
};

//--------------------------------------------------------------------------------------------
//  DB 저장 메시지 - 
//--------------------------------------------------------------------------------------------
#define df_DBQUERY_MSG_PLAYER_UPDATE		2
struct st_DBQUERY_MSG_PLAYER_UPDATE
{
	__int64	iAccountNo;
	int	iLevel;
	__int64 iExp;
};


struct st_DBQUERY_HEADER_mempool
{
	WORD	Type;
	WORD	Size;

	char buff[128];
};